# Project 2 Part 2
**Design a MySQL database**

In [1]:
import pandas as pd

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists,create_database
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/csbro/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

## Calculate max string lengths for object columns

### Basics

In [3]:
basics_df=pd.read_csv('data/basics-filtered.csv')
basics_df.info()
basics_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

#### Check character length for object columns to design database

In [4]:
ttype_len = basics_df['titleType'].fillna("").map(len).max()
ttype_len

5

In [5]:
ptype_len = basics_df['primaryTitle'].fillna("").map(len).max()
ptype_len

242

In [6]:
otitle_len = basics_df['originalTitle'].fillna("").map(len).max()
otitle_len

242

In [7]:
genre_len = basics_df['genres'].fillna("").map(len).max()
genre_len

29

### Ratings

In [8]:
ratings_df=pd.read_csv('data/ratings-filtered.csv')
ratings_df.info()
ratings_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 155990 entries, 0 to 155989
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         155990 non-null  object
 1   averageRating  155990 non-null  float64
 2   numVotes       155990 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 3.6+ MB

      tconst  averageRating  numVotes
0  tt0000009            5.3       206
1  tt0000147            5.3       477
2  tt0000574            6.0       837
3  tt0000591            4.4        20
4  tt0000679            5.1        68

In [9]:
tconstr_len = ratings_df['tconst'].fillna("").map(len).max()
tconstr_len

10

## Movies ERD

![png](data/moviesERD.png)

In [10]:
db_name = 'movies'
conn = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/{db_name}"
engine = create_engine(conn, pool_pre_ping=True)

In [11]:
#Preview names of tables
q ="""
SHOW TABLES;
"""
pd.read_sql(q,engine)

  Tables_in_movies
0           basics
1           genres
2          ratings
3     title_genres
4        tmdb_data

In [12]:
#Check if db exists
if database_exists(conn):
    print("It exists!")
else:
    create_database(conn)
    print('Database created')

It exists!

## Preparing data and Importing

#### Basics tables

In [13]:

q = """
DESCRIBE basics;
"""
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,char(15),NO,PRI,None,
1,primary_title,varchar(250),YES,,None,
2,start_year,float,YES,,None,
3,runtime_mins,int,YES,,None,
4,created_date,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_date,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

#### Checking columns and names

In [14]:
#checking field names
describe['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime_mins',
       'created_date', 'updated_date'], dtype=object)

In [15]:
#checking dataframe's columns
basics_df.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [16]:
#Drop unused columns
basics_df.drop(columns= ['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres'], 
            inplace = True, axis = 1)
basics_df.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes'], dtype='object')

In [17]:
#Rename column so names matc
rename_basics = {'primaryTitle':'primary_title', 'startYear':'start_year', 'runtimeMinutes':'runtime_mins'}
basics_df = basics_df.rename(rename_basics, axis = 1)
basics_df.head(1)

      tconst   primary_title  start_year  runtime_mins
0  tt0035423  Kate & Leopold      2001.0           118

#### Review Data Types

In [18]:
#Review SQL table data types
describe [['Field', 'Type']]

           Field          Type
0         tconst      char(15)
1  primary_title  varchar(250)
2     start_year         float
3   runtime_mins           int
4   created_date      datetime
5   updated_date      datetime

In [19]:
#Review dataframe data types
basics_df.dtypes

tconst            object
primary_title     object
start_year       float64
runtime_mins       int64
dtype: object

In [20]:
#Load Basics table
basics_df.to_sql("basics", engine, index=False, if_exists='append')

86979

In [21]:
# Confirm data has been added
q = """
SELECT * FROM basics
LIMIT 5;
"""
pd.read_sql(q,engine)

,tconst,primary_title,start_year,runtime_mins,created_date,updated_date
0,tt0035423,Kate & Leopold,2001.0,118,2023-11-11 15:51:26,2023-11-11 15:51:26
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,2023-11-11 15:51:26,2023-11-11 15:51:26
2,tt0069049,The Other Side of the Wind,2018.0,122,2023-11-11 15:51:26,2023-11-11 15:51:26
3,tt0088751,The Naked Monster,2005.0,100,2023-11-11 15:51:26,2023-11-11 15:51:26
4,tt0096056,Crime and Punishment,2002.0,126,2023-11-11 15:51:26,2023-11-11 15:51:26

In [22]:
basics_df.to_csv(f"MovieData/basics_data.csv.gz", compression = 'gzip', index=False)

#### Ratings Tables

In [23]:
#Filter out US only movies using the basics dataframe

# Filter the basics table  to include only the US movies
us_titles =ratings_df['tconst'].isin(basics_df['tconst'])
ratings_df = ratings_df[us_titles]
ratings_df

           tconst  averageRating  numVotes
10474   tt0035423            6.4     87153
22925   tt0062336            6.4       175
25916   tt0069049            6.7      7754
33166   tt0088751            5.2       336
35884   tt0096056            5.6       846
...           ...            ...       ...
155984  tt9914942            6.6       178
155986  tt9915872            6.4         9
155987  tt9916170            7.0         7
155988  tt9916190            3.7       243
155989  tt9916362            6.4      5422

[71900 rows x 3 columns]

In [24]:

q = """
DESCRIBE ratings;
"""
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,avg_rating,float,YES,,None,
1,num_votes,int,YES,,None,
2,date_created,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,date_update,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,tconst,char(15),NO,PRI,None,

#### Checking columns and names

In [25]:
#checking field names
describe['Field'].values

array(['avg_rating', 'num_votes', 'date_created', 'date_update', 'tconst'],
      dtype=object)

In [26]:
ratings_df.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [27]:
## There are no unused columns to drop
#Drop unused columns
#ratings_df.drop(columns= ['cols_to_drop'], 
#            inplace = True, axis = 1)
#ratings_df.columns

In [28]:
#Rename column so names match
rename_ratings = {'averageRating':'avg_rating', 'numVotes':'num_votes'}
ratings_df = ratings_df.rename(rename_ratings, axis = 1)
ratings_df.head(1)

          tconst  avg_rating  num_votes
10474  tt0035423         6.4      87153

#### Review datatypes

In [29]:
#Review SQL table data types
describe [['Field', 'Type']]

          Field      Type
0    avg_rating     float
1     num_votes       int
2  date_created  datetime
3   date_update  datetime
4        tconst  char(15)

In [30]:
ratings_df.dtypes

tconst         object
avg_rating    float64
num_votes       int64
dtype: object

In [31]:
#Load ratings table
ratings_df.to_sql("ratings", engine, index=False, if_exists='append')

71900

In [32]:
ratings_df.to_csv(f"MovieData/ratings_data.csv.gz", compression = 'gzip', index=False)

In [33]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q, engine)

   avg_rating  num_votes        date_created         date_update     tconst
0         6.4      87153 2023-11-11 15:51:29 2023-11-11 15:51:29  tt0035423
1         6.4        175 2023-11-11 15:51:29 2023-11-11 15:51:29  tt0062336
2         6.7       7754 2023-11-11 15:51:29 2023-11-11 15:51:29  tt0069049
3         5.2        336 2023-11-11 15:51:29 2023-11-11 15:51:29  tt0088751
4         5.6        846 2023-11-11 15:51:29 2023-11-11 15:51:29  tt0096056

### Genres

In [34]:

q = """
DESCRIBE genres;
"""
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(20)  YES         None

In [35]:
# Confirm data has been added
q = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

### Title_genres

In [36]:

q = """
DESCRIBE title_genres;
"""
describe = pd.read_sql(q, engine)
describe

      Field      Type Null  Key Default Extra
0    tconst  char(15)   NO  PRI    None
1  genre_id       int   NO  PRI    None

In [37]:
# Confirm data has been added
q = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []